
## ===========================================================================
## brew
## ===========================================================================

## better grep
brew "ack"
brew "ripgrep"

## git & git tools
brew "git"
brew "tig"
brew "git-flow"
brew "hub"

## gnu version tar
brew "gnu-tar"

## ip address calculator
brew "ipcalc"

## json query tool
brew "jq"

## languages
brew "rust"
cask "java"
brew "sbt"

## http client
brew "httpie"

brew "global", args:["with-ctags", "with-pygments"]

## aws client
brew "awscli"

## DB client
brew "mycli"
brew "pgcli"

## newer screen + utf8 patch
tap "rcmdnk/rcmdnkpac"
brew "rcmdnk/rcmdnkpac/screenutf8", args:["utf8"]

## tmux
brew "tmux", args:["with-utf8proc"]
brew "gawk"
brew "ansifilter"

## fonts
tap "caskroom/fonts"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-noto-mono"
cask "font-roboto-mono-for-powerline"

## QuickLook
cask "qlstephen"
cask "qlmarkdown"


## ===========================================================================
## brew cask
## ===========================================================================
cask "karabiner-elements"
cask "hyperswitch"
cask "iterm2"

cask "google-chrome"
cask "firefox"

cask "gas-mask"
cask "wireshark"
cask "visual-studio-code"
cask "virtualbox"
cask "docker"
cask "kitematic"

## Java 8
tap "caskroom/versions"
cask "java8"


## ===========================================================================
## mas
## ===========================================================================
mas 'WinArchiver Lite', id: 414855915
mas 'The Unarchiver', id: 425424353
mas 'CotEditor', id: 1024640650
mas 'Xcode', id: 497799835

