
## ===========================================================================
## brew
## ===========================================================================

## shells
brew "zsh"
brew "fish"
brew "fzf"

## better grep
brew "ripgrep"

## git & git tools
brew "git"
brew "tig"
brew "git-flow"
brew "hub"
brew "ghq"
brew "git-secrets"

## gnu version utils(date, etc)
brew "coreutils"
brew "gnu-tar"
brew "gawk"

## compress & decompress
brew "lzop"
brew "lz4"

## ip address calculator
brew "ipcalc"

## json, csv query tool
brew "jq"
brew "csvkit"

## editor
brew "vim"

## languages
brew "rustup-init"
tap "homebrew/cask-versions"
cask "adoptopenjdk8"
brew "sbt"
brew "maven"
brew "pipenv"

## build & test tools
brew "bazel"
brew "circleci"
brew "shellcheck"

## http client
brew "httpie"
brew "wget"

## http debugging proxy
#brew "protobuf", args:["without-python@2"]
#brew "mitmproxy"
cask "proxyman"
brew "privoxy"

## monitoring tools
brew "iftop"
brew "prometheus"

brew "global"

## code statistics
brew "cloc"

## infrastructure
brew "awscli"
tap "weaveworks/tap"
brew "weaveworks/tap/eksctl"
brew "amazon-ecs-cli"
brew "docker-credential-helper-ecr"
brew "aws-elasticbeanstalk"
brew "tfenv"
cask "google-cloud-sdk"
brew "packer"
brew "terraform-docs"
brew "terraformer"

tap "coinbase/assume-role"
brew "coinbase/assume-role/assume-role"

## DB client
brew "mysql"
brew "pgcli"
brew "percona-toolkit"
brew "tokyo-cabinet"

## json, yaml converter
brew "remarshal"
brew "jsonnet"

## newer screen + utf8 patch
tap "rcmdnk/rcmdnkpac"
brew "rcmdnk/rcmdnkpac/screenutf8", args:["utf8"]

## tmux
brew "tmux"
brew "ansifilter"

## fonts
tap "homebrew/cask-fonts"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-noto-mono"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"

## Containers
cask "virtualbox"
cask "docker"
brew "kompose"
brew "kubernetes-helm"
brew "skaffold"
brew "kops"
brew "kubectx"
tap "argoproj/tap"
brew "argo"
tap "shyiko/kubesec"
brew "shyiko/kubesec/kubesec"
brew "kustomize"
brew "derailed/k9s/k9s"

brew "hadolint"

## dotfile management
tap "thoughtbot/formulae"
brew "rcm"

## ssh
tap "madogiwa/pssh"
brew "madogiwa/pssh/parallel-ssh"

## image & movie
brew "imagemagick"
brew "ffmpeg"
brew "mozjpeg"

## job management
brew "digdag"


## ===========================================================================
## Mac Apps (cask)
## ===========================================================================
cask "karabiner-elements"
cask "hyperswitch"
cask "iterm2"

cask "google-chrome"
cask "firefox"
cask "vivaldi"

#cask "gas-mask"
cask "wireshark"
cask "visual-studio-code"


## ===========================================================================
## Mac Apps (mas)
## ===========================================================================
mas 'WinArchiver Lite', id: 414855915
mas 'The Unarchiver', id: 425424353
mas 'CotEditor', id: 1024640650
mas 'Xcode', id: 497799835

