
## web browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"

## shell & tools
brew "fzf"
brew "watch"
brew "shellcheck"
brew "sponge"
brew "starship"
brew "rtx"
brew "sheldon"
brew "direnv"

brew "gnupg"
brew "bat"
brew "tree"

## languages
brew "rustup-init"

## man
brew "tealdeer"

## search
brew "ripgrep"
brew "global"
brew "fd"

## git & git tools
brew "git"
brew "git-lfs"
brew "tig"
brew "git-flow"
brew "ghq"
brew "git-secrets"
brew "gibo"
brew "gh"
brew "git-delta"

## gnu utils(date, etc)
brew "coreutils"
brew "gnu-tar"
brew "gawk"
brew "gnu-time"

## compress & decompress
brew "lzop"
brew "lz4"

## utilities
### ip address calculator
brew "ipcalc"

### regex generator
brew "grex"

## json, csv query tool
brew "jq"
brew "gron"
brew "yq"
brew "csvkit"
brew "csvq"

## editor
brew "vim"

## CI tools
brew "bazel"
brew "skaffold"
brew "act"

## http & api tools
brew "httpie"
brew "wget"
brew "protobuf"

brew "mkcert"
brew "nss"

## http debugging proxy
#brew "mitmproxy"
cask "proxyman"
brew "privoxy"

## monitoring tools
brew "mtr"

## code statistics
brew "cloc"

## infrastructure
brew "awscli"

# Bundled with Docker Desktop
#brew "docker-credential-helper-ecr"

brew "aws-elasticbeanstalk"
cask "google-cloud-sdk"
brew "packer"

brew "tfenv"
brew "terraform-docs"
brew "terraformer"

tap "madogiwa/assume-role"
brew "madogiwa/assume-role/assume-role"

## DB client
brew "mysql"
brew "postgresql@14"
brew "pgcli"
brew "percona-toolkit"
brew "tokyo-cabinet"

## json, yaml converter
brew "remarshal"
brew "jsonnet"

## newer screen + utf8 patch

## Terminal Multiplexer
brew "tmux"
brew "tmux-xpanes"
brew "ansifilter"
#tap "rcmdnk/rcmdnkpac"
#brew "rcmdnk/rcmdnkpac/screenutf8", args:["utf8"]

## fonts
tap "homebrew/cask-fonts"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-noto-mono"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

## Containers
cask "docker"
brew "kompose"
brew "helm"
brew "kubectx"
brew "krew"
brew "argo"
brew "kustomize"
brew "k9s"
brew "stern"
brew "kind"
brew "dive"
brew "docker-slim"

brew "minikube"

brew "hadolint"

tap "datawire/blackbird"
brew "datawire/blackbird/telepresence"

## dotfile management
brew "rcm"

## ssh
brew "pssh"
cask "secretive"

## image & movie
brew "imagemagick"
brew "ffmpeg"
brew "mozjpeg"

## video conference
cask "zoom"
cask "discord"

## window management
cask "alt-tab"

## usability
cask "karabiner-elements"
cask "clipy"

## tools
cask "appcleaner"

## terminal
cask "iterm2"

## network
cask "wireshark"
cask "switchhosts"

## editor
cask "visual-studio-code"
cask "libreoffice"

## development
cask "altair-graphql-client"

## screen capture
brew "t-rec"
cask "kap"

## translator
cask "deepl"

