
## ===========================================================================
## brew
## ===========================================================================

## shell & tools
brew "zsh"
brew "fzf"
brew "watch"
brew "shellcheck"
brew "sponge"

## man
brew "tldr"

## text search
brew "ripgrep"
brew "global"

## git & git tools
brew "git"
brew "git-lfs"
brew "tig"
brew "git-flow"
brew "ghq"
brew "git-secrets"
brew "gibo"
tap "github/gh"
brew "gh"

## gnu utils(date, etc)
brew "coreutils"
brew "gnu-tar"
brew "gawk"

## compress & decompress
brew "lzop"
brew "lz4"

## ip address calculator
brew "ipcalc"

## json, csv query tool
brew "jq"
brew "yq"
brew "csvkit"
tap "noborus/tap"
brew "trdsql"

## editor
brew "vim"

## rust
brew "rustup-init"

## java
tap "homebrew/cask-versions"
cask "adoptopenjdk8"
brew "sbt"
brew "maven"
brew "pipenv"

## CI tools
brew "bazel"
brew "skaffold"
brew "circleci"
brew "act"

## http & api tools
brew "httpie"
brew "wget"
brew "protobuf"

## http debugging proxy
#brew "mitmproxy"
cask "proxyman"
brew "privoxy"

## monitoring tools
brew "iftop"
brew "prometheus"
brew "mtr"

## code statistics
brew "cloc"

## infrastructure
brew "awscli"
tap "weaveworks/tap"
brew "weaveworks/tap/eksctl"
brew "amazon-ecs-cli"
brew "docker-credential-helper-ecr"
brew "aws-elasticbeanstalk"
cask "google-cloud-sdk"
brew "packer"

brew "tfenv"
brew "terraform-docs"
brew "terraformer"

tap "madogiwa/assume-role"
brew "madogiwa/assume-role/assume-role"

## DB client
brew "mysql"
brew "postgresql"
brew "pgcli"
brew "percona-toolkit"
brew "tokyo-cabinet"

## json, yaml converter
brew "remarshal"
brew "jsonnet"

## newer screen + utf8 patch

## Terminal Multiplexer
brew "tmux"
brew "tmux-xpanes"
brew "ansifilter"
#tap "rcmdnk/rcmdnkpac"
#brew "rcmdnk/rcmdnkpac/screenutf8", args:["utf8"]

## fonts
tap "homebrew/cask-fonts"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-noto-mono"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-powerline"

## Containers
cask "docker"
brew "kompose"
brew "kubernetes-helm"
brew "kubectx"
brew "krew"
tap "argoproj/tap"
brew "argo"
tap "shyiko/kubesec"
brew "shyiko/kubesec/kubesec"
brew "kustomize"
brew "derailed/k9s/k9s"
brew "stern"
brew "kind"
brew "dive"
brew "docker-slim"

brew "minikube"

tap "goodwithtech/r"
brew "dockertags"

brew "hadolint"

tap "FairwindsOps/tap"
brew "FairwindsOps/tap/polaris"

## dotfile management
tap "thoughtbot/formulae"
brew "rcm"

## ssh
brew "pssh"

tap "xen0l/homebrew-taps"
brew "aws-gate"

## image & movie
brew "imagemagick"
brew "ffmpeg"
brew "mozjpeg"

## job management
brew "digdag"

## video conference
cask "zoomus"


## ===========================================================================
## Mac Apps (cask)
## ===========================================================================

cask "karabiner-elements"
cask "clipy"
cask "hyperswitch"

cask "iterm2"

cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-developer-edition"

cask "appcleaner"

cask "wireshark"
cask "switchhosts"

cask "visual-studio-code"
cask "libreoffice"

cask "altair-graphql-client"

cask "kap"
cask "deepl"
cask "zoomus"

